{
  "main": {
    "name":"Ferry Hinardi",
    "occupation":"Software Engineer - Web Developer",
    "description":"A highly skilled Software Development Professional with over five years of experience in software design, development, and integration, offering advanced expertise in React.js and JavaScript.",
    "image":"profilepic.jpg",
    "bio":"A highly skilled Software Development Professional with over five years of experience in software design, development, and integration, offering advanced expertise in React.js and JavaScript. Possesses a strong background in building E-Commerce applications, with a proven track record of writing clean, reliable code and developing scalable systems. Thrives in complex problem-solving environments with an analytical and driven mindset. Contributed to projects including <a href='http://jaztip.com'>Jaztip Apps</a>, <a href='https://www.maideasy.my'>Maideasy Apps</a>, and Ryna - a co-living and apartment rental platform.",
    "contactmessage":"Feel free to reach out if you'd like to collaborate or discuss opportunities.",
    "email": "hinardi93@gmail.com",
    "phone": "+6281958020882",
    "address":{
      "street": "Tangerang (Kab.)",
      "city": "Tangerang",
      "state": "Banten",
      "zip": "15331"
    },
    "website": "http://www.ferryhinardi.com",
    "resumedownload":"https://drive.google.com/file/d/1v6O21CWWGx7pUQxy56HuCepnLTigjxQ5/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"http://facebook.com/ferry.hinardi",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/FerryHinardi",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/ferryhinardi",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/ferryhinardi",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/ferryhinardi",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Advanced expertise in modern web development technologies and frameworks.",
    "education":[
      {
        "school":"Bina Nusantara University",
        "degree":"Bachelor of Science - Applied Database",
        "graduated":"2015",
        "description":"West Jakarta. Gained hands-on experience balancing academic studies with professional work in IT Department, developing strong time management and workplace readiness skills."
      }
    ],
    "work":[
      {
        "company":"Traveloka",
        "title":"Software Engineer - Web Developer",
        "years":"2020 - Present",
        "description":"Led frontend development for Traveloka's flight booking form redesign, contributing to a 10.16% increase in net revenue. Maintained and optimized web performance for Transport Products (Flights, Trains, Bus & Travel), improving Core Web Vitals. Developed a debugging tool reducing issue resolution time by 30%. Handled metasearch flight integrations with partners including Google Flights, Skyscanner, KAYAK, Wego, Travelko, and Naver."
      },
      {
        "company":"PT Trinusa Travelindo (Traveloka)",
        "title":"Software Engineer - React Native Developer",
        "years":"2019 - 2020",
        "description":"Developed a new Visa product for Traveloka, enabling users to apply for visas for Japan, Australia, China, and India through mobile and web platforms. Built and maintained the mobile application using React Native and web application using React.js. Handled end-to-end user flows from document pickup scheduling to final visa delivery."
      },
      {
        "company":"PT. Global Prima Solusindo",
        "title":"Software Engineer Developer",
        "years":"2018 - 2019",
        "description":"Collaborated across the full software development lifecycle for an education platform connecting students, teachers and parents. Developed applications for both desktop and mobile operating systems. Designed and implemented end-to-end backend architecture using GraphQL. Documented technical workflows in an internal wiki to support onboarding and knowledge sharing."
      },
      {
        "company":"PT Salestock Indonesia (Sorabel)",
        "title":"Software Engineer - React Developer",
        "years":"2016 - 2018",
        "description":"Developed the Warehouse Management System (WMS) UI using React.js, covering the full frontend flow from purchase order creation and quality control to barcode preparation and delivery. Built and enhanced customer-facing features for Salestock's e-commerce women's fashion platform using React Native, including feed list views, checkout flow, payment, and review screens."
      },
      {
        "company":"PT Suzuki Indomobil",
        "title":"Software Engineer",
        "years":"2015 - 2016",
        "description":"Participated in highly complex software engineering projects. Resolved hardware and software compatibility issues to ensure reliable system performance and integration. Analyzed existing systems to identify requirements and opportunities for new web and database applications. Developed new web and database applications aligned with user needs and project specifications."
      },
      {
        "company":"Bina Nusantara",
        "title":"Front End Engineer",
        "years":"2013 - 2015",
        "description":"Coded responsive websites using HTML, CSS, JavaScript and jQuery to implement interactive user interfaces. Translated design mockups into functional web pages using HTML, JavaScript, AJAX and JSON. Implemented front-end enhancements by proposing, designing and developing solutions to fulfill feature requests and address reported issues."
      }
    ],
    "skills":[
      {
        "name":"React.js",
        "level":"95%"
      },
      {
        "name":"TypeScript",
        "level":"90%"
      },
      {
        "name":"Next.js",
        "level":"85%"
      },
      {
        "name":"React Native",
        "level":"85%"
      },
      {
        "name":"JavaScript",
        "level":"95%"
      },
      {
        "name":"GitHub Actions",
        "level":"75%"
      },
      {
        "name":"AWS (S3, CloudFront, ECS)",
        "level":"70%"
      },
      {
        "name":"GraphQL",
        "level":"75%"
      },
      {
        "name":"Figma",
        "level":"65%"
      },
      {
        "name":"HTML5 & CSS",
        "level":"90%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Traveloka Flight Booking",
        "category":"Led frontend development for flight booking form redesign, contributing to 10.16% revenue increase. Integrated with multiple metasearch partners including Google Flights, Skyscanner, and KAYAK.",
        "image":"jaztip.png",
        "url":"https://www.traveloka.com"
      },
      {
        "title":"Maideasy",
        "category":"Developed a home services booking app from scratch using React Native, improving user experience for seamless cleaner reservations. A Malaysian platform that revolutionises the way we book part-time cleaners.",
        "image":"maideasy.png",
        "url":"https://www.maideasy.my"
      },
      {
        "title":"Jaztip",
        "category":"The social-commerce marketplace in Indonesia. Buying and selling application where you can find seller info as well as requests for purchase of goods, and directly connect to the chat application of your choice.",
        "image":"jaztip.png",
        "url":"https://www.jaztip.com"
      },
      {
        "title":"Ryna",
        "category":"A co-living and apartment rental platform that leverages technology to make renting easier and safer for people who identify as women, while giving them the proper tools to pave their own path and build a life they love.",
        "image":"jaztip.png",
        "url":"#"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"It's not the technology that changes the world. It's the people using technology that changes the world.",
        "user":"Jack Ma"
      },
      {
        "text":"Technology is just a tool. In terms of getting the kids working together and motivating them. The teacher is the most important.",
        "user":"Bill Gates"
      }
    ]
  }
}
