{
  "main": {
    "name": "Ferry Hinardi",
    "occupation": "Software Engineer - Web Developer",
    "description": "Transforming ideas into elegant digital experiences. 5+ years crafting high-performance web applications with React.js, TypeScript, and modern web technologies.",
    "image": "profilepic.jpg",
    "bio": "I'm a passionate software engineer who loves turning complex problems into elegant solutions. With over 5 years of experience, I've had the privilege of working on projects that impact millions of users daily. My expertise lies in building lightning-fast, user-centric web applications using React.js, TypeScript, and Next.js. From architecting scalable e-commerce platforms to optimizing performance that directly boosts revenue, I thrive on challenges that push the boundaries of what's possible. I've contributed to exciting projects like <a href='http://jaztip.com'>Jaztip</a> - Indonesia's social-commerce marketplace, <a href='https://www.maideasy.my'>Maideasy</a> - revolutionizing home services booking, and Ryna - empowering co-living experiences. When I'm not coding, you'll find me exploring new technologies, contributing to open source, or mentoring fellow developers.",
    "contactmessage": "Whether you have a challenging project, an innovative idea, or just want to say hello—I'd love to hear from you. Let's build something extraordinary together.",
    "email": "hinardi93@gmail.com",
    "phone": "+6281958020882",
    "address": {
      "street": "Tangerang (Kab.)",
      "city": "Tangerang",
      "state": "Banten",
      "zip": "15331"
    },
    "website": "http://www.ferryhinardi.com",
    "resumedownload": "/Ferry-Hinardi-Resume-2025.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "http://facebook.com/ferry.hinardi",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/FerryHinardi",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ferryhinardi",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/ferryhinardi",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/ferryhinardi",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I believe in mastering the fundamentals while staying ahead of the curve. My toolkit spans the entire modern web development ecosystem—from crafting pixel-perfect UIs with React and TypeScript to architecting cloud-native solutions on AWS. Every line of code I write is driven by performance, scalability, and user delight.",
    "education": [
      {
        "school": "Bina Nusantara University",
        "degree": "Bachelor of Science - Applied Database",
        "graduated": "2015",
        "description": "Earned my degree while working full-time in the IT Department—proving that passion and dedication can conquer any challenge. This experience taught me invaluable lessons in time management, resilience, and real-world problem-solving that no classroom could provide."
      }
    ],
    "work": [
      {
        "company": "Traveloka",
        "title": "Software Engineer - Web Developer",
        "years": "2020 - Present",
        "description": "Driving innovation at one of Southeast Asia's leading travel platforms. Spearheaded the flight booking form redesign that significantly increased revenue—translating to substantial business impact. Architected a custom debugging tool that slashed issue resolution time by 30%, saving countless engineering hours. Currently maintaining performance excellence across Transport Products (Flights, Trains, Bus) and orchestrating seamless integrations with global metasearch giants like Google Flights, Skyscanner, KAYAK, Wego, and Naver."
      },
      {
        "company": "PT Trinusa Travelindo (Traveloka)",
        "title": "Software Engineer - React Native Developer",
        "years": "2019 - 2020",
        "description": "Pioneered Traveloka's revolutionary Visa product from concept to launch, empowering travelers to apply for visas to Japan, Australia, China, and India—all from their mobile devices. Built a seamless cross-platform experience using React Native and React.js, handling the complete user journey from document scheduling to doorstep visa delivery. This product opened new revenue streams and simplified what used to be a tedious process for thousands of users."
      },
      {
        "company": "PT. Global Prima Solusindo",
        "title": "Software Engineer Developer",
        "years": "2018 - 2019",
        "description": "Architected and delivered a comprehensive education platform that bridges students, teachers, and parents in one unified ecosystem. Took ownership of the entire tech stack—from designing a robust GraphQL backend to building intuitive cross-platform applications. Established technical documentation standards that became the foundation for team knowledge sharing and faster onboarding. This role sharpened my full-stack capabilities and taught me the art of building scalable, maintainable systems."
      },
      {
        "company": "PT Salestock Indonesia (Sorabel)",
        "title": "Software Engineer - React Developer",
        "years": "2016 - 2018",
        "description": "Built the backbone of Sorabel's operations—a sophisticated Warehouse Management System (WMS) using React.js that streamlined the entire fulfillment pipeline from purchase orders to final delivery. Simultaneously enhanced the customer-facing mobile app with React Native, crafting delightful shopping experiences including feed views, seamless checkout flows, secure payments, and review systems. This dual focus taught me the importance of building for both internal efficiency and customer satisfaction."
      },
      {
        "company": "PT Suzuki Indomobil",
        "title": "Software Engineer",
        "years": "2015 - 2016",
        "description": "Launched my professional journey tackling enterprise-scale challenges in the automotive industry. Debugged complex hardware-software integration issues, ensuring rock-solid system reliability. Analyzed legacy systems and transformed user requirements into modern web and database solutions. This foundational experience taught me the discipline of writing production-grade code and the importance of thorough system analysis."
      },
      {
        "company": "Bina Nusantara",
        "title": "Front End Engineer",
        "years": "2013 - 2015",
        "description": "Where it all began—my first dive into the world of web development. Transformed static designs into living, breathing websites using HTML, CSS, JavaScript, and jQuery. Mastered the art of translating design mockups into pixel-perfect, interactive experiences while learning the fundamentals of AJAX and JSON. This role ignited my passion for frontend development and set me on the path to becoming the engineer I am today."
      }
    ],
    "skills": [
      {
        "name": "React.js",
        "level": "95%"
      },
      {
        "name": "TypeScript",
        "level": "90%"
      },
      {
        "name": "Next.js",
        "level": "85%"
      },
      {
        "name": "React Native",
        "level": "85%"
      },
      {
        "name": "JavaScript",
        "level": "95%"
      },
      {
        "name": "GitHub Actions",
        "level": "75%"
      },
      {
        "name": "AWS (S3, CloudFront, ECS)",
        "level": "70%"
      },
      {
        "name": "GraphQL",
        "level": "75%"
      },
      {
        "name": "Figma",
        "level": "65%"
      },
      {
        "name": "HTML5 & CSS",
        "level": "90%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Traveloka Flight",
        "category": "Redesigned Traveloka's flight booking experience, driving significant revenue growth. Orchestrated complex integrations with global metasearch platforms including Google Flights, Skyscanner, and KAYAK—connecting millions of travelers with their perfect flights.",
        "description": "Led the complete redesign of Traveloka's flight booking experience for millions of users across Southeast Asia.",
        "challenge": "Complex integration with multiple global metasearch platforms while maintaining high performance and user experience. The existing flight booking flow had multiple pain points affecting conversion rates, and we needed to support seamless data exchange with partners like Google Flights, Skyscanner, KAYAK, Wego, and Naver without compromising speed or reliability.",
        "solution": "Architected a scalable React/TypeScript solution with GraphQL for efficient data fetching. Implemented progressive enhancement strategies, optimized bundle sizes through code splitting, and streamlined the booking funnel from 5 steps to 3. Built robust API integrations with error handling and fallback mechanisms to ensure smooth partner platform connectivity.",
        "impact": "Significantly improved revenue and user satisfaction metrics. Successfully integrated with all major metasearch platforms, expanding Traveloka's market reach. Reduced page load time by 40% and increased mobile conversion rates, directly contributing to the company's growth in the competitive travel booking market.",
        "role": "Frontend Lead",
        "team": "Cross-functional team of 8 engineers, designers, and product managers",
        "duration": "8 months",
        "image": "traveloka-owl-icon.png",
        "url": "https://www.traveloka.com",
        "liveUrl": "https://www.traveloka.com/en-id/flight",
        "technologies": [
          "React.js",
          "TypeScript",
          "GraphQL",
          "AWS",
          "Next.js"
        ]
      },
      {
        "title": "Supertool.id",
        "category": "Crafted a comprehensive suite of developer tools and utilities to supercharge productivity. A one-stop platform featuring everything from JSON formatters and code generators to image optimizers and API testing tools. Built to make developers' lives easier, one tool at a time.",
        "description": "A comprehensive productivity platform offering 50+ developer tools and utilities in one place.",
        "challenge": "Developers waste valuable time switching between multiple websites and tools for common tasks like JSON formatting, code generation, image optimization, and API testing. There was a need for a fast, reliable, all-in-one platform that works offline and respects user privacy.",
        "solution": "Built a modern Next.js application with client-side processing for instant results and privacy protection. Implemented a modular architecture allowing easy addition of new tools. Used TypeScript for type safety and Tailwind CSS for consistent, responsive design. Deployed on Vercel's edge network for global low-latency access.",
        "impact": "Successfully launched with 50+ tools covering JSON/XML processing, code generators, image optimization, text utilities, and API testing. Growing user base of developers who appreciate the fast, privacy-focused approach. All processing happens client-side, ensuring data never leaves the user's browser.",
        "role": "Solo Developer",
        "team": "Individual project",
        "duration": "Ongoing since 2023",
        "image": "supertool.png",
        "url": "https://supertool.id/",
        "liveUrl": "https://supertool.id/",
        "technologies": [
          "Next.js",
          "TypeScript",
          "Vercel",
          "Tailwind CSS"
        ]
      },
      {
        "title": "Maideasy",
        "category": "Built from ground zero—a beautifully crafted React Native app that revolutionized home cleaning services in Malaysia. Designed intuitive booking flows that made finding and scheduling professional cleaners as easy as ordering food delivery.",
        "description": "Mobile-first platform revolutionizing home cleaning services booking in Malaysia.",
        "challenge": "Traditional home cleaning service booking involved multiple phone calls, unclear pricing, and scheduling conflicts. Users needed a transparent, on-demand solution similar to food delivery apps, but for professional cleaning services. The app needed to work seamlessly across iOS and Android with real-time updates and payment processing.",
        "solution": "Built a React Native application from scratch with intuitive booking flows, real-time cleaner tracking, transparent pricing calculator, and secure payment integration. Implemented Firebase for real-time updates and push notifications. Created a responsive design that works perfectly on all screen sizes with offline support for browsing services.",
        "impact": "Successfully launched in the Malaysian market, connecting hundreds of users with professional cleaning services. Reduced booking time from hours of phone calls to under 3 minutes. Achieved high user satisfaction ratings with the intuitive interface and reliable service delivery tracking.",
        "role": "Mobile Developer",
        "team": "Team of 4 (2 developers, 1 designer, 1 PM)",
        "duration": "6 months (MVP + iterations)",
        "image": "maideasy.png",
        "url": "https://www.maideasy.my",
        "liveUrl": "https://www.maideasy.my",
        "technologies": [
          "React Native",
          "TypeScript",
          "Firebase",
          "GraphQL"
        ]
      },
      {
        "title": "Jaztip",
        "category": "Indonesia's innovative social-commerce marketplace where buying meets community. Built a seamless platform connecting buyers and sellers, with smart integrations to popular chat apps for instant communication. Making e-commerce more personal, one connection at a time.",
        "description": "Social-commerce marketplace combining e-commerce with community-driven buying in Indonesia.",
        "challenge": "Traditional e-commerce platforms lack the personal touch and trust that Indonesian consumers prefer. Buyers wanted to communicate directly with sellers through familiar chat apps before making purchases, but existing platforms didn't support this seamlessly. The platform needed to bridge formal e-commerce with informal social interactions.",
        "solution": "Developed a React.js web platform with smart integrations to popular Indonesian messaging apps (WhatsApp, Line, Telegram). Built a product discovery feed similar to social media, combined with traditional e-commerce features like cart, checkout, and order tracking. Implemented seller profiles with ratings and direct chat capabilities.",
        "impact": "Created a unique marketplace that resonated with Indonesian shopping culture, where personal relationships matter. Enabled thousands of small businesses to reach customers while maintaining the personal touch they're known for. The chat integration feature became the most-used functionality, validating the social-commerce approach.",
        "role": "Frontend Developer",
        "team": "Team of 5 engineers",
        "duration": "1 year",
        "image": "jaztip.png",
        "url": "https://www.jaztip.com",
        "liveUrl": "https://www.jaztip.com",
        "technologies": [
          "React.js",
          "JavaScript",
          "Firebase",
          "Node.js"
        ]
      },
      {
        "title": "Ryna",
        "category": "Empowering women through technology. A forward-thinking co-living platform that combines safety, community, and convenience. Built with cutting-edge tech to help women find their perfect living space and build the life they envision.",
        "description": "Co-living platform designed specifically for women's safety, community, and convenience.",
        "challenge": "Women seeking rental housing often face safety concerns, lack of community, and complicated booking processes. Traditional rental platforms don't address the unique needs of female renters, including verified safe locations, community building, and transparent landlord vetting. There was a gap in the market for a women-focused housing solution.",
        "solution": "Built a full-stack web application using React.js and Node.js with MongoDB for data management. Implemented comprehensive search filters for safety features, amenities, and community preferences. Created a verification system for both properties and residents, integrated virtual tours, and built community features including forums and event planning.",
        "impact": "Launched a safe space for women to find and connect over housing, addressing a critical market need. The platform emphasizes community building alongside housing, creating networks of support among residents. Verification systems and safety features became key differentiators, providing peace of mind for users and their families.",
        "role": "Full Stack Developer",
        "team": "Team of 3 developers",
        "duration": "8 months",
        "image": "ryna.png",
        "url": "#",
        "technologies": [
          "React.js",
          "Node.js",
          "MongoDB",
          "Express"
        ]
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Ferry is an exceptional frontend engineer who consistently delivers high-quality work. His expertise in React and TypeScript helped us rebuild our flight booking system, which directly contributed to improved conversion rates. He's not just a great coder—he's a problem solver who thinks about the business impact of every technical decision.",
        "user": "Alex Chen",
        "title": "Engineering Manager",
        "company": "Traveloka",
        "relationship": "Worked together at Traveloka (2020-2024)"
      },
      {
        "text": "I had the pleasure of collaborating with Ferry on multiple projects. What stands out is his ability to translate complex requirements into clean, maintainable code. He's also an excellent mentor who takes time to help junior developers grow. Any team would be lucky to have him.",
        "user": "Sarah Johnson",
        "title": "Senior Product Designer",
        "company": "Traveloka",
        "relationship": "Collaborated on Traveloka Flight redesign"
      },
      {
        "text": "Ferry's work on our React Native mobile app was outstanding. He built features that were not only technically solid but also delightful to use. His attention to detail in performance optimization and user experience made a real difference in our app ratings.",
        "user": "Michael Tan",
        "title": "Lead Mobile Developer",
        "company": "Maideasy",
        "relationship": "Worked together on Maideasy mobile app"
      }
    ]
  }
}