{
  "main": {
    "name": "Ferry Hinardi",
    "occupation": "Software Engineer - Web Developer",
    "description": "Transforming ideas into elegant digital experiences. 5+ years crafting high-performance web applications with React.js, TypeScript, and modern web technologies.",
    "image": "profilepic.jpg",
    "bio": "I'm a passionate software engineer who loves turning complex problems into elegant solutions. With over 5 years of experience, I've had the privilege of working on projects that impact millions of users daily. My expertise lies in building lightning-fast, user-centric web applications using React.js, TypeScript, and Next.js. From architecting scalable e-commerce platforms to optimizing performance that directly boosts revenue, I thrive on challenges that push the boundaries of what's possible. I've contributed to exciting projects like <a href='http://jaztip.com'>Jaztip</a> - Indonesia's social-commerce marketplace, <a href='https://www.maideasy.my'>Maideasy</a> - revolutionizing home services booking, and Ryna - empowering co-living experiences. When I'm not coding, you'll find me exploring new technologies, contributing to open source, or mentoring fellow developers.",
    "contactmessage": "Whether you have a challenging project, an innovative idea, or just want to say hello—I'd love to hear from you. Let's build something extraordinary together.",
    "email": "hinardi93@gmail.com",
    "phone": "+6281958020882",
    "address": {
      "street": "Tangerang (Kab.)",
      "city": "Tangerang",
      "state": "Banten",
      "zip": "15331"
    },
    "website": "http://www.ferryhinardi.com",
    "resumedownload": "/Ferry-Hinardi-Resume-2025.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "http://facebook.com/ferry.hinardi",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/FerryHinardi",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ferryhinardi",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/ferryhinardi",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/ferryhinardi",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I believe in mastering the fundamentals while staying ahead of the curve. My toolkit spans the entire modern web development ecosystem—from crafting pixel-perfect UIs with React and TypeScript to architecting cloud-native solutions on AWS. Every line of code I write is driven by performance, scalability, and user delight.",
    "education": [
      {
        "school": "Bina Nusantara University",
        "degree": "Bachelor of Science - Applied Database",
        "graduated": "2015",
        "description": "Earned my degree while working full-time in the IT Department—proving that passion and dedication can conquer any challenge. This experience taught me invaluable lessons in time management, resilience, and real-world problem-solving that no classroom could provide."
      }
    ],
    "work": [
      {
        "company": "Traveloka",
        "title": "Software Engineer - Web Developer",
        "years": "2020 - Present",
        "description": "Driving innovation at one of Southeast Asia's leading travel platforms. Spearheaded the flight booking form redesign that generated a 10.16% revenue boost—translating to millions in additional revenue. Architected a custom debugging tool that slashed issue resolution time by 30%, saving countless engineering hours. Currently maintaining performance excellence across Transport Products (Flights, Trains, Bus) and orchestrating seamless integrations with global metasearch giants like Google Flights, Skyscanner, KAYAK, Wego, and Naver."
      },
      {
        "company": "PT Trinusa Travelindo (Traveloka)",
        "title": "Software Engineer - React Native Developer",
        "years": "2019 - 2020",
        "description": "Pioneered Traveloka's revolutionary Visa product from concept to launch, empowering travelers to apply for visas to Japan, Australia, China, and India—all from their mobile devices. Built a seamless cross-platform experience using React Native and React.js, handling the complete user journey from document scheduling to doorstep visa delivery. This product opened new revenue streams and simplified what used to be a tedious process for thousands of users."
      },
      {
        "company": "PT. Global Prima Solusindo",
        "title": "Software Engineer Developer",
        "years": "2018 - 2019",
        "description": "Architected and delivered a comprehensive education platform that bridges students, teachers, and parents in one unified ecosystem. Took ownership of the entire tech stack—from designing a robust GraphQL backend to building intuitive cross-platform applications. Established technical documentation standards that became the foundation for team knowledge sharing and faster onboarding. This role sharpened my full-stack capabilities and taught me the art of building scalable, maintainable systems."
      },
      {
        "company": "PT Salestock Indonesia (Sorabel)",
        "title": "Software Engineer - React Developer",
        "years": "2016 - 2018",
        "description": "Built the backbone of Sorabel's operations—a sophisticated Warehouse Management System (WMS) using React.js that streamlined the entire fulfillment pipeline from purchase orders to final delivery. Simultaneously enhanced the customer-facing mobile app with React Native, crafting delightful shopping experiences including feed views, seamless checkout flows, secure payments, and review systems. This dual focus taught me the importance of building for both internal efficiency and customer satisfaction."
      },
      {
        "company": "PT Suzuki Indomobil",
        "title": "Software Engineer",
        "years": "2015 - 2016",
        "description": "Launched my professional journey tackling enterprise-scale challenges in the automotive industry. Debugged complex hardware-software integration issues, ensuring rock-solid system reliability. Analyzed legacy systems and transformed user requirements into modern web and database solutions. This foundational experience taught me the discipline of writing production-grade code and the importance of thorough system analysis."
      },
      {
        "company": "Bina Nusantara",
        "title": "Front End Engineer",
        "years": "2013 - 2015",
        "description": "Where it all began—my first dive into the world of web development. Transformed static designs into living, breathing websites using HTML, CSS, JavaScript, and jQuery. Mastered the art of translating design mockups into pixel-perfect, interactive experiences while learning the fundamentals of AJAX and JSON. This role ignited my passion for frontend development and set me on the path to becoming the engineer I am today."
      }
    ],
    "skills": [
      {
        "name": "React.js",
        "level": "95%"
      },
      {
        "name": "TypeScript",
        "level": "90%"
      },
      {
        "name": "Next.js",
        "level": "85%"
      },
      {
        "name": "React Native",
        "level": "85%"
      },
      {
        "name": "JavaScript",
        "level": "95%"
      },
      {
        "name": "GitHub Actions",
        "level": "75%"
      },
      {
        "name": "AWS (S3, CloudFront, ECS)",
        "level": "70%"
      },
      {
        "name": "GraphQL",
        "level": "75%"
      },
      {
        "name": "Figma",
        "level": "65%"
      },
      {
        "name": "HTML5 & CSS",
        "level": "90%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Traveloka Flight",
        "category": "Redesigned Traveloka's flight booking experience, driving a massive 10.16% revenue increase. Orchestrated complex integrations with global metasearch platforms including Google Flights, Skyscanner, and KAYAK—connecting millions of travelers with their perfect flights.",
        "image": "traveloka-owl-icon.png",
        "url": "https://www.traveloka.com",
        "technologies": [
          "React.js",
          "TypeScript",
          "GraphQL",
          "AWS",
          "Next.js"
        ]
      },
      {
        "title": "Supertool.id",
        "category": "Crafted a comprehensive suite of developer tools and utilities to supercharge productivity. A one-stop platform featuring everything from JSON formatters and code generators to image optimizers and API testing tools. Built to make developers' lives easier, one tool at a time.",
        "image": "supertool.png",
        "url": "https://supertool.id/",
        "technologies": [
          "Next.js",
          "TypeScript",
          "Vercel",
          "Tailwind CSS"
        ]
      },
      {
        "title": "Maideasy",
        "category": "Built from ground zero—a beautifully crafted React Native app that revolutionized home cleaning services in Malaysia. Designed intuitive booking flows that made finding and scheduling professional cleaners as easy as ordering food delivery.",
        "image": "maideasy.png",
        "url": "https://www.maideasy.my",
        "technologies": [
          "React Native",
          "TypeScript",
          "Firebase",
          "GraphQL"
        ]
      },
      {
        "title": "Jaztip",
        "category": "Indonesia's innovative social-commerce marketplace where buying meets community. Built a seamless platform connecting buyers and sellers, with smart integrations to popular chat apps for instant communication. Making e-commerce more personal, one connection at a time.",
        "image": "jaztip.png",
        "url": "https://www.jaztip.com",
        "technologies": [
          "React.js",
          "JavaScript",
          "Firebase",
          "Node.js"
        ]
      },
      {
        "title": "Ryna",
        "category": "Empowering women through technology. A forward-thinking co-living platform that combines safety, community, and convenience. Built with cutting-edge tech to help women find their perfect living space and build the life they envision.",
        "image": "ryna.png",
        "url": "#",
        "technologies": [
          "React.js",
          "Node.js",
          "MongoDB",
          "Express"
        ]
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "The best way to predict the future is to invent it.",
        "user": "Alan Kay"
      },
      {
        "text": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
        "user": "Martin Fowler"
      }
    ]
  }
}